trunk/evcpe/testfiles/get_parameter_names_all.xml

<?xml version="1.0"?>
<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
      <soap:Header>
        <cwmp:ID soap:mustUnderstand="1">1234</cwmp:ID>
        <cwmp:NoMoreRequests>1</cwmp:NoMoreRequests>
      </soap:Header>
      <soap:Body>
        <cwmp:GetParameterNames>
  	<cwmp:ParameterPath></cwmp:ParameterPath>
  	<cwmp:NextLevel>0</cwmp:NextLevel>
        </cwmp:GetParameterNames>
      </soap:Body>
  </soap:Envelope>
